; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v9 ?v6)
             (pred_9 ?v3 ?v8)
             (pred_5 ?v9 ?v8)
             (pred_12 ?v11 ?v9 )
	     (pred_7 ?v9)
             (pred_6 ?v12)
             (pred_10 ?v3)
             (pred_3 ?v8)
             (pred_11 ?v9)
             (pred_4 ?v3)
             (pred_1 ?v9)
             (pred_2 ))



(:action op_2
:parameters (?v13 ?v1 ?v4 ?v7)
:precondition (and (pred_6 ?v13) (pred_6 ?v1) (pred_10 ?v4) (pred_3 ?v7)
          (pred_8 ?v13 ?v1) (pred_9 ?v4 ?v7)
                   (pred_5 ?v1 ?v7) (pred_7 ?v13) 
                   (pred_11 ?v1) (pred_4 ?v4))
:effect (and  (pred_1 ?v1) (not (pred_11 ?v1))))


(:action op_5
:parameters (?v13 ?v2)
:precondition (and (pred_6 ?v13) (pred_6 ?v2)
               (pred_7 ?v13) (pred_8 ?v13 ?v2) (pred_1 ?v2))
:effect (and (pred_7 ?v2) (not (pred_7 ?v13))))

(:action op_4
:parameters (?v13 ?v4)
:precondition (and (pred_6 ?v13) (pred_10 ?v4) 
                  (pred_7 ?v13) (pred_12 ?v4 ?v13) (pred_2 ))
:effect (and (pred_4 ?v4)
   (not (pred_12 ?v4 ?v13)) (not (pred_2 ))))


(:action op_3
:parameters (?v13 ?v10 ?v5)
:precondition (and (pred_6 ?v13) (pred_10 ?v10) (pred_10 ?v5)
                  (pred_7 ?v13) (pred_4 ?v5) (pred_12 ?v10 ?v13))
:effect (and (pred_4 ?v10) (pred_12 ?v5 ?v13)
        (not (pred_4 ?v5)) (not (pred_12 ?v10 ?v13))))

(:action op_1
:parameters (?v13 ?v4)
:precondition (and (pred_6 ?v13) (pred_10 ?v4) 
                  (pred_7 ?v13) (pred_4 ?v4))
:effect (and (pred_2 ) (pred_12 ?v4 ?v13) (not (pred_4 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_16 obj_20 obj_17 obj_15 obj_18 obj_14 obj_11 obj_05 obj_01 obj_10 obj_19 obj_04 obj_03 obj_08 obj_02
    obj_06 obj_09
    obj_07 obj_13
    )

    (:init
       (pred_2)

       (pred_6 obj_12)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_17)
       (pred_6 obj_15)
       (pred_6 obj_18)
       (pred_6 obj_14)
       (pred_6 obj_11)
       (pred_6 obj_05)
       (pred_6 obj_01)
       (pred_6 obj_10)
       (pred_6 obj_19)
       (pred_6 obj_04)
       (pred_6 obj_03)
       (pred_6 obj_08)
       (pred_6 obj_02)
       (pred_3 obj_06)
       (pred_3 obj_09)
       (pred_10 obj_07)
       (pred_10 obj_13)

       (pred_8 obj_12 obj_15)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_16 obj_20)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_20 obj_17)
       (pred_8 obj_20 obj_16)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_17 obj_20)
       (pred_8 obj_15 obj_05)
       (pred_8 obj_15 obj_18)
       (pred_8 obj_15 obj_12)
       (pred_8 obj_18 obj_01)
       (pred_8 obj_18 obj_14)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_18 obj_15)
       (pred_8 obj_14 obj_10)
       (pred_8 obj_14 obj_11)
       (pred_8 obj_14 obj_20)
       (pred_8 obj_14 obj_18)
       (pred_8 obj_11 obj_19)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_11 obj_14)
       (pred_8 obj_05 obj_04)
       (pred_8 obj_05 obj_01)
       (pred_8 obj_05 obj_15)
       (pred_8 obj_01 obj_03)
       (pred_8 obj_01 obj_10)
       (pred_8 obj_01 obj_18)
       (pred_8 obj_01 obj_05)
       (pred_8 obj_10 obj_08)
       (pred_8 obj_10 obj_19)
       (pred_8 obj_10 obj_14)
       (pred_8 obj_10 obj_01)
       (pred_8 obj_19 obj_02)
       (pred_8 obj_19 obj_11)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_04 obj_05)
       (pred_8 obj_03 obj_08)
       (pred_8 obj_03 obj_01)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_08 obj_02)
       (pred_8 obj_08 obj_10)
       (pred_8 obj_08 obj_03)
       (pred_8 obj_02 obj_19)
       (pred_8 obj_02 obj_08)
       (pred_11 obj_01)
       (pred_11 obj_08)
       (pred_5  obj_01 obj_06)
       (pred_5  obj_08 obj_09)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_1 obj_20)
       (pred_1 obj_17)
       (pred_1 obj_15)
       (pred_1 obj_18)
       (pred_1 obj_14)
       (pred_1 obj_11)
       (pred_1 obj_05)
       (pred_1 obj_10)
       (pred_1 obj_19)
       (pred_1 obj_04)
       (pred_1 obj_03)
       (pred_1 obj_02)

       (pred_9  obj_07 obj_06)
       (pred_9  obj_13 obj_09)
       (pred_12 obj_07 obj_10)
       (pred_12 obj_13 obj_15)
       (pred_7 obj_05)
    )

    (:goal (and
       (pred_12 obj_07 obj_19)
    ))
(:constraints
  (always (not (pred_7 obj_14)))
)
)

; plan
1. (op_5 obj_05 obj_15)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_15)
   goals met: 0 of 1
2. (op_5 obj_15 obj_18)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_18)
   goals met: 0 of 1
3. (op_5 obj_18 obj_16)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_16)
   goals met: 0 of 1
4. (op_5 obj_16 obj_20)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_20)
   goals met: 0 of 1
5. (op_5 obj_20 obj_17)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_17)
   goals met: 0 of 1
6. (op_5 obj_17 obj_11)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_11)
   goals met: 0 of 1
7. (op_5 obj_11 obj_19)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_19)
   goals met: 0 of 1
8. (op_5 obj_19 obj_10)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_10)
   goals met: 0 of 1
9. (op_4 obj_10 obj_07)
   deleted: (pred_12 obj_07 obj_10) (pred_2)
   added: (pred_4 obj_07)
   goals met: 0 of 1
10. (op_5 obj_10 obj_19)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_19)
   goals met: 0 of 1
11. (op_1 obj_19 obj_07)
   deleted: (pred_4 obj_07)
   added: (pred_2) (pred_12 obj_07 obj_19)
   goals met: 1 of 1
